doc/parse-cloudy-output.org
#+SEQ_TODO: TODO(t) STARTED(s) WAITING(w@) | DONE(d) CANCELED(c@)
#+STYLE: <link rel="stylesheet" type="text/css" href="main.css" />

Claudia is a lightweight python library for parsing the output from the Cloudy plasma code. The design goal is to be as flexible as possible, and to present a simple interface to the user. The Cloudy save files (or "punch files" in Cloudy versions before 10) are identified automatically from the input script and each file is loaded into a numpy record array, so that the data columns are immediately available with the same names as in the output file: 

#+srcname: usage-example
#+begin_src python
  import claudia
  m = claudia.CloudyModel("mymodel")
  
  import pylab
  plot(m.ovr.depth, m.ovr.eden)
  xlabel("Depth, cm")
  ylabel("log10 (Electron Density, pcc)")
#+end_src

* The source code for =claudia.py=
  :LOGBOOK:
  CLOCK: [2011-08-23 Tue 09:40]--[2011-08-23 Tue 10:50] =>  1:10
  CLOCK: [2011-06-27 Mon 23:28]--[2011-06-27 Mon 23:46] =>  0:18
  CLOCK: [2011-06-26 Sun 22:54]--[2011-06-26 Sun 23:23] =>  0:29
  :END:
  :PROPERTIES:
  :tangle:   ../src/claudia.py
  :dir: ~/Work/Nahiely/proplyd-cloudy/src
  :comments: org
  :cache:    yes
  :END:

** Imports

#+srcname: claudia-imports
#+begin_src python
  import numpy
  import argparse
  import string
  import os
#+end_src

** Utility classes

*** [1/1] Some SmartDict classes
+ /I am still not convinced that this is a good idea/
  + Currently I am using my modified version for the =metadata= attribute, where it can't do much harm.
  + My main improvement over the original is that mine supports tab completion of attributes. 
+ Taken from the interesting [[http://code.activestate.com/recipes/577590-dictionary-whos-keys-act-like-attributes-as-well/][Python Recipe]] by [[http://code.activestate.com/recipes/users/4174115/][Sunjay Varma]]
+ One problem with using this is that the tab completion does not work for the attributes
+ [X] How can this be fixed?
  + We could do =self.__dict__[name] = value= in =__setattr__()=
  + Yes, this is now implemented in =WJHSmartDict= below. It turned out that I had to change the implementation a lot. I no longer need to define =__getattr__()=, since =__setattr__()= defines both the attribute and the dict item. Meanwhile, =__setitem==()= does exactly the same as =__setattr__()= . I also had to define =__init__()=, =__delattr__()= and =update*()= for completeness. 


#+srcname: claudia-smartdict
#+begin_src python
  class SmartDict(dict):
      """
      Combines the features of a class and a dict
      """
      def __getattr__(self, name):
          try:
              return self[name]
          except KeyError as e:
              raise AttributeError(e)
      def __setattr__(self, name, value):
          self[name] = value
  
  class WJHSmartDict(dict):
      """
      Combines the features of a class and a dict in a different way
  
      This has the advantage that tab completion works on attributes. 
      Are there any disadvantages?
  
      The attributes and the dict keys are views on the same data:
  
      >>> d = WJHSmartDict(x=1, y=2)
      >>> d.x
      1
      >>> d['x']
      1
      >>> d.y is d['y']
      True
      >>> d.update(dict(aa=[100, 200], bb=500))
      >>> d.aa[1] += 10
      >>> d['aa']
      [100, 210]
  
      """
      def __init__(self, **kwdargs):
          for k in kwdargs:
              setattr(self, k, kwdargs[k])
  
      def __setattr__(self, name, value):
          dict.__setitem__(self, name, value)
          self.__dict__[name] = value
  
      def __delattr__(self, name):
          self.__dict__.pop(name)
          self.pop(name)
  
      __setitem__ = __setattr__
  
      def update(self, E):
          """
          Supplement dict update by also updating self.__dict__
  
          This doesn't work for **kwdargs though.
          """
          dict.update(self.__dict__, E)
          dict.update(self, E)
  
  
#+end_src

**** Original description by Sunjay Varma from Python Recipes

Dictionary Who's Keys Act Like Attributes As Well (Python recipe)

Think of this as a JavaScript object. In JavaScript, the objects can be referenced by indexing (e.g. d[name]) or by directly using the dot (.) operator (e.g. d.name).

This is the same concept.

Note to Python 2.4 Users: You will need to change the =except KeyError as e:= line to =except KeyError, (e):=.

#+begin_example
>>> d = Dict(radius=10)
>>> d.radius
10
>>> d.copy = 10
>>> d.copy
<built-in method copy of Dict object at 0x02A056B8>
>>> d["copy"]
10
>>> d.copy()
{'copy': 10, 'radius': 10}
>>> d.fromkeys = lambda x: x * 2
>>> d.fromkeys([10], [10])
{10: [10]}
>>> d["fromkeys"](20)
40
#+end_example

