doc/parse-cloudy-output.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Parse Cloudy Output with claudia.py</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-24 13:12:23 CDT"/>
<meta name="author" content="William Henney"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="main.css" />

</head>
<body>


<div id="content">
<h1 class="title">Parse Cloudy Output with claudia.py</h1>

<p>Claudia is a lightweight python library for parsing the output from the Cloudy plasma code. The design goal is to be as flexible as possible, and to present a simple interface to the user. The Cloudy save files (or "punch files" in Cloudy versions before 10) are identified automatically from the input script and each file is loaded into a numpy record array, so that the data columns are immediately available with the same names as in the output file: 
</p>



<pre class="src src-python"><span style="color: #008a00;">import</span> claudia
<span style="color: #8a6407;">m</span> = claudia.CloudyModel(<span style="color: #698a21;">"mymodel"</span>)

<span style="color: #008a00;">import</span> pylab
plot(m.ovr.depth, m.ovr.eden)
xlabel(<span style="color: #698a21;">"Depth, cm"</span>)
ylabel(<span style="color: #698a21;">"log10 (Electron Density, pcc)"</span>)
</pre>






<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 The source code for <code>claudia.py</code> </a>
<ul>
<li><a href="#sec-1-1">1.1 Imports </a></li>
<li><a href="#sec-1-2">1.2 Utility classes </a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 [1/1] Some SmartDict classes </a>
<ul>
<li><a href="#sec-1-2-1-1">1.2.1.1 Original description by Sunjay Varma from Python Recipes </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 The class for a Cloudy model </a></li>
<li><a href="#sec-1-4">1.4 Parsing the save files </a></li>
<li><a href="#sec-1-5">1.5 Parsing the input file </a>
<ul>
<li><a href="#sec-1-5-1">1.5.1 List of possibilities for cloudy save files </a></li>
<li><a href="#sec-1-5-2">1.5.2 Find basic info about the run </a></li>
<li><a href="#sec-1-5-3">1.5.3 Find which save files were written </a></li>
<li><a href="#sec-1-5-4">1.5.4 Utility functions for input parsing </a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6 Mindlessly loading all the data from all the output files </a></li>
<li><a href="#sec-1-7">1.7 Dealing with multiple iterations </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Tests for <code>claudia.py</code> </a>
<ul>
<li><a href="#sec-2-1">2.1 Example data for tests </a></li>
<li><a href="#sec-2-2">2.2 Unittest tests </a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 Example unittest tests </a></li>
<li><a href="#sec-2-2-2">2.2.2 Run all the unit tests </a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3 Doctest tests </a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 Run all the doctest tests in claudia.py </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 Infrastructure for tangling the code and exporting HTML docs </a>
<ul>
<li><a href="#sec-3-1">3.1 How can we automate this better? </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The source code for <code>claudia.py</code> </h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Imports </h3>
<div class="outline-text-3" id="text-1-1">





<pre class="src src-python"><span style="color: #008a00;">import</span> numpy
<span style="color: #008a00;">import</span> argparse
<span style="color: #008a00;">import</span> string
<span style="color: #008a00;">import</span> os
</pre>





</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Utility classes </h3>
<div class="outline-text-3" id="text-1-2">



</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> [1/1] Some SmartDict classes </h4>
<div class="outline-text-4" id="text-1-2-1">

<ul>
<li><i>I am still not convinced that this is a good idea</i>
<ul>
<li>Currently I am using my modified version for the <code>metadata</code> attribute, where it can't do much harm.
</li>
<li>My main improvement over the original is that mine supports tab completion of attributes. 
</li>
</ul>

</li>
<li>Taken from the interesting <a href="http://code.activestate.com/recipes/577590-dictionary-whos-keys-act-like-attributes-as-well/">Python Recipe</a> by <a href="http://code.activestate.com/recipes/users/4174115/">Sunjay Varma</a>
</li>
<li>One problem with using this is that the tab completion does not work for the attributes
</li>
<li><code>[X]</code> How can this be fixed?
<ul>
<li>We could do <code>self.__dict__[name] = value</code> in <code>__setattr__()</code>
</li>
<li>Yes, this is now implemented in <code>WJHSmartDict</code> below. It turned out that I had to change the implementation a lot. I no longer need to define <code>__getattr__()</code>, since <code>__setattr__()</code> defines both the attribute and the dict item. Meanwhile, <code>__setitem==()</code> does exactly the same as <code>__setattr__()</code> . I also had to define <code>__init__()</code>, <code>__delattr__()</code> and <code>update*()</code> for completeness. 
</li>
</ul>

</li>
</ul>






<pre class="src src-python"><span style="color: #008a00;">class</span> <span style="color: #218a21;">SmartDict</span>(<span style="color: #8a4688;">dict</span>):
    <span style="color: #698a21;">"""</span>
<span style="color: #698a21;">    Combines the features of a class and a dict</span>
<span style="color: #698a21;">    """</span>
    <span style="color: #008a00;">def</span> <span style="color: #00008a;">__getattr__</span>(<span style="color: #008a00;">self</span>, name):
        <span style="color: #008a00;">try</span>:
            <span style="color: #008a00;">return</span> <span style="color: #008a00;">self</span>[name]
        <span style="color: #008a00;">except</span> <span style="color: #218a21;">KeyError</span> <span style="color: #008a00;">as</span> e:
            <span style="color: #008a00;">raise</span> <span style="color: #218a21;">AttributeError</span>(e)
    <span style="color: #008a00;">def</span> <span style="color: #00008a;">__setattr__</span>(<span style="color: #008a00;">self</span>, name, value):
        <span style="color: #008a00;">self</span>[name] = value

<span style="color: #008a00;">class</span> <span style="color: #218a21;">WJHSmartDict</span>(<span style="color: #8a4688;">dict</span>):
    <span style="color: #698a21;">"""</span>
<span style="color: #698a21;">    Combines the features of a class and a dict in a different way</span>

<span style="color: #698a21;">    This has the advantage that tab completion works on attributes. </span>
<span style="color: #698a21;">    Are there any disadvantages?</span>

<span style="color: #698a21;">    The attributes and the dict keys are views on the same data:</span>

<span style="color: #698a21;">    &gt;&gt;&gt; d = WJHSmartDict(x=1, y=2)</span>
<span style="color: #698a21;">    &gt;&gt;&gt; d.x</span>
<span style="color: #698a21;">    1</span>
<span style="color: #698a21;">    &gt;&gt;&gt; d['x']</span>
<span style="color: #698a21;">    1</span>
<span style="color: #698a21;">    &gt;&gt;&gt; d.y is d['y']</span>
<span style="color: #698a21;">    True</span>
<span style="color: #698a21;">    &gt;&gt;&gt; d.update(dict(aa=[100, 200], bb=500))</span>
<span style="color: #698a21;">    &gt;&gt;&gt; d.aa[1] += 10</span>
<span style="color: #698a21;">    &gt;&gt;&gt; d['aa']</span>
<span style="color: #698a21;">    [100, 210]</span>

<span style="color: #698a21;">    """</span>
    <span style="color: #008a00;">def</span> <span style="color: #00008a;">__init__</span>(<span style="color: #008a00;">self</span>, **kwdargs):
        <span style="color: #008a00;">for</span> k <span style="color: #008a00;">in</span> kwdargs:
            <span style="color: #8a4688;">setattr</span>(<span style="color: #008a00;">self</span>, k, kwdargs[k])

    <span style="color: #008a00;">def</span> <span style="color: #00008a;">__setattr__</span>(<span style="color: #008a00;">self</span>, name, value):
        <span style="color: #8a4688;">dict</span>.__setitem__(<span style="color: #008a00;">self</span>, name, value)
        <span style="color: #008a00;">self</span>.__dict__[name] = value

    <span style="color: #008a00;">def</span> <span style="color: #00008a;">__delattr__</span>(<span style="color: #008a00;">self</span>, name):
        <span style="color: #008a00;">self</span>.__dict__.pop(name)
        <span style="color: #008a00;">self</span>.pop(name)

    __setitem__ = __setattr__

    <span style="color: #008a00;">def</span> <span style="color: #00008a;">update</span>(<span style="color: #008a00;">self</span>, E):
        <span style="color: #698a21;">"""</span>
<span style="color: #698a21;">        Supplement dict update by also updating self.__dict__</span>

<span style="color: #698a21;">        This doesn't work for **kwdargs though.</span>
<span style="color: #698a21;">        """</span>
        <span style="color: #8a4688;">dict</span>.update(<span style="color: #008a00;">self</span>.__dict__, E)
        <span style="color: #8a4688;">dict</span>.update(<span style="color: #008a00;">self</span>, E)


</pre>






</div>

<div id="outline-container-1-2-1-1" class="outline-5">
<h5 id="sec-1-2-1-1"><span class="section-number-5">1.2.1.1</span> Original description by Sunjay Varma from Python Recipes </h5>
<div class="outline-text-5" id="text-1-2-1-1">


<p>
Dictionary Who's Keys Act Like Attributes As Well (Python recipe)
</p>
<p>
Think of this as a JavaScript object. In JavaScript, the objects can be referenced by indexing (e.g. d[name]) or by directly using the dot (.) operator (e.g. d.name).
</p>
<p>
This is the same concept.
</p>
<p>
Note to Python 2.4 Users: You will need to change the <code>except KeyError as e:</code> line to <code>except KeyError, (e):</code>.
</p>



<pre class="example">&gt;&gt;&gt; d = Dict(radius=10)
&gt;&gt;&gt; d.radius
10
&gt;&gt;&gt; d.copy = 10
&gt;&gt;&gt; d.copy
&lt;built-in method copy of Dict object at 0x02A056B8&gt;
&gt;&gt;&gt; d["copy"]
10
&gt;&gt;&gt; d.copy()
{'copy': 10, 'radius': 10}
&gt;&gt;&gt; d.fromkeys = lambda x: x * 2
&gt;&gt;&gt; d.fromkeys([10], [10])
{10: [10]}
&gt;&gt;&gt; d["fromkeys"](20)
40
</pre>



</div>
</div>
</div>

</div>
