doc/parse-cloudy-output.org
** The class for a Cloudy model


#+srcname: claudia-model-class
#+begin_src python
  SAVETYPES_TWO_LINE_HEADER = [
      "line emissivity",
      ] 
  
  class CloudyModel(object):
      """
      A single Cloudy model
  
      >>> from claudia import CloudyModel
      >>> modelname = 'sample01'
      >>> CloudyModel.indir = '../testdata'
      >>> CloudyModel.outdir = '../testdata'
      >>> m = CloudyModel(modelname)
      """
      indir, outdir = ".", "."
      insuff, outsuff = ".in", ".out"
      # list of save types to skip (problematic to read with genfromtxt)
      skipsaves = ["continuum", "line emissivity"]
  
  
      def __init__(self, modelname, **kwargs):
          # Any optional keywords get set as attributes
          # We do this first in case indir or insuff are set
          self.__dict__.update(kwargs)
  
          # "metadata" for each file implemented as a SmartDict of SmartDicts
          self.metadata = WJHSmartDict()
  
          # Read in the input script
          self.infilepath = os.path.join(self.indir, modelname + self.insuff)
          with open(self.infilepath) as f:
              self._inscript = f.read() 
  
          # Now read in from all the save files
          for savetype, savesuff in find_save_commands(self._inscript):
              savefilepath = os.path.join(self.outdir, modelname + savesuff)
              saveid = savesuff[1:]       # strip the leading dot to make the attribute name
              if not savetype in self.skipsaves:
                  skip = 0 if not savetype in SAVETYPES_TWO_LINE_HEADER else 1
                  setattr(self, saveid, recarray_from_savefile(savefilepath, skip))
                  self.metadata[saveid] = WJHSmartDict(savetype=savetype, savefilepath=savefilepath)
  
  
  
#+end_src

** Parsing the save files

+ It is almost impossible to do this cleanly with output from older versions of Cloudy. At the moment I am resorting to editing the header of the "line emissivity" file to put the header on two lines and delete the final tab. 

+ [2011-08-23 Tue] Some design questions:

  + Recarray looks useful, since it gives you attribute access for free. But, if we make, for instance,  =model.ovr= actually /be/ a recarray, then it doesn't allow adding extra metadata to the instance. So, there are two possibilities:

    1. Use the composition pattern and have that =model.ovr.data= is the recarray, so we can have things like =model.ovr.savetype= as well.

    2. An alternative design would be to optimize for the most common use-case by making =model.ovr= be the recarray, and then putting the metadata somewhere else, such as =model.metadata.ovr.savetype=

  + For the moment, we are going to plump for the second option, even though it is a bit more work to implement. 




#+srcname: claudia-parse-save-file
#+begin_src python
  def recarray_from_savefile(filepath, skip=0):
      return numpy.genfromtxt(filepath, delimiter='\t', skip_header=skip,
                              invalid_raise=False, names=True).view(numpy.recarray)
  
#+end_src



** Parsing the input file

*** List of possibilities for cloudy save files

+ Taken from Hazy1 C10 version 2011/08/14
+ This is nowhere near exhaustive
+ These are checked in turn, so more specific types should come first. 

#+srcname: claudia-types-of-cloudy-save-files
#+begin_src python
  SAVETYPES = [
      "diffuse continuum", 
      "emitted continuum", 
      "fine continuum", 
      "grain continuum", 
      "incident continuum", 
      "interactive continuum", 
      "ionizing continuum", 
      "outward continuum", 
      "raw continuum", 
      "reflected continuum", 
      "transmitted continuum", 
      "two photon continuum", 
      "continuum", 
      "cooling",
      "dr",
      "dynamics",
      "element hydrogen",
      "element helium",
      "element carbon",
      "element nitrogen",
      "element oxygen",
      "element sulfur",
      "element silicon",
      "element iron",
      "heating",
      "line emissivity",
      "line list", 
      "overview",
      "PDR",
      "physical conditions",
      "pressure",
      "radius",
      "source function, spectrum",
      "source function, depth",
      ]
#+end_src

*** TODO Find basic info about the run
    :LOGBOOK:
    CLOCK: [2011-08-20 Sat 18:24]--[2011-08-21 Sun 00:04] =>  5:40
    :END:
We should at least read the =title= and =save prefix= lines (currently we assume that the prefix is the same as for the input file). 

#+srcname: claudia-input-parse-basic-info
#+begin_src python
  pass
  
#+end_src


