doc/parse-cloudy-output.html

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> The class for a Cloudy model </h3>
<div class="outline-text-3" id="text-1-3">






<pre class="src src-python"><span style="color: #8a6407;">SAVETYPES_TWO_LINE_HEADER</span> = [
    <span style="color: #698a21;">"line emissivity"</span>,
    ] 

<span style="color: #008a00;">class</span> <span style="color: #218a21;">CloudyModel</span>(<span style="color: #8a4688;">object</span>):
    <span style="color: #698a21;">"""</span>
<span style="color: #698a21;">    A single Cloudy model</span>

<span style="color: #698a21;">    &gt;&gt;&gt; from claudia import CloudyModel</span>
<span style="color: #698a21;">    &gt;&gt;&gt; modelname = 'sample01'</span>
<span style="color: #698a21;">    &gt;&gt;&gt; CloudyModel.indir = '../testdata'</span>
<span style="color: #698a21;">    &gt;&gt;&gt; CloudyModel.outdir = '../testdata'</span>
<span style="color: #698a21;">    &gt;&gt;&gt; m = CloudyModel(modelname)</span>
<span style="color: #698a21;">    """</span>
    indir, outdir = <span style="color: #698a21;">"."</span>, <span style="color: #698a21;">"."</span>
    insuff, outsuff = <span style="color: #698a21;">".in"</span>, <span style="color: #698a21;">".out"</span>
    <span style="color: #473c8a;"># </span><span style="color: #473c8a;">list of save types to skip (problematic to read with genfromtxt)</span>
    skipsaves = [<span style="color: #698a21;">"continuum"</span>, <span style="color: #698a21;">"line emissivity"</span>]


    <span style="color: #008a00;">def</span> <span style="color: #00008a;">__init__</span>(<span style="color: #008a00;">self</span>, modelname, **kwargs):
        <span style="color: #473c8a;"># </span><span style="color: #473c8a;">Any optional keywords get set as attributes</span>
        <span style="color: #473c8a;"># </span><span style="color: #473c8a;">We do this first in case indir or insuff are set</span>
        <span style="color: #008a00;">self</span>.__dict__.update(kwargs)

        <span style="color: #473c8a;"># </span><span style="color: #473c8a;">"metadata" for each file implemented as a SmartDict of SmartDicts</span>
        <span style="color: #008a00;">self</span>.metadata = WJHSmartDict()

        <span style="color: #473c8a;"># </span><span style="color: #473c8a;">Read in the input script</span>
        <span style="color: #008a00;">self</span>.infilepath = os.path.join(<span style="color: #008a00;">self</span>.indir, modelname + <span style="color: #008a00;">self</span>.insuff)
        <span style="color: #008a00;">with</span> <span style="color: #8a4688;">open</span>(<span style="color: #008a00;">self</span>.infilepath) <span style="color: #008a00;">as</span> f:
            <span style="color: #008a00;">self</span>._inscript = f.read() 

        <span style="color: #473c8a;"># </span><span style="color: #473c8a;">Now read in from all the save files</span>
        <span style="color: #008a00;">for</span> savetype, savesuff <span style="color: #008a00;">in</span> find_save_commands(<span style="color: #008a00;">self</span>._inscript):
            savefilepath = os.path.join(<span style="color: #008a00;">self</span>.outdir, modelname + savesuff)
            saveid = savesuff[1:]       <span style="color: #473c8a;"># </span><span style="color: #473c8a;">strip the leading dot to make the attribute name</span>
            <span style="color: #008a00;">if</span> <span style="color: #008a00;">not</span> savetype <span style="color: #008a00;">in</span> <span style="color: #008a00;">self</span>.skipsaves:
                skip = 0 <span style="color: #008a00;">if</span> <span style="color: #008a00;">not</span> savetype <span style="color: #008a00;">in</span> SAVETYPES_TWO_LINE_HEADER <span style="color: #008a00;">else</span> 1
                <span style="color: #8a4688;">setattr</span>(<span style="color: #008a00;">self</span>, saveid, recarray_from_savefile(savefilepath, skip))
                <span style="color: #008a00;">self</span>.metadata[saveid] = WJHSmartDict(savetype=savetype, savefilepath=savefilepath)



</pre>





</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Parsing the save files </h3>
<div class="outline-text-3" id="text-1-4">


<ul>
<li>It is almost impossible to do this cleanly with output from older versions of Cloudy. At the moment I am resorting to editing the header of the "line emissivity" file to put the header on two lines and delete the final tab. 

</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2011-08-23 Tue</span></span> Some design questions:

<ul>
<li>Recarray looks useful, since it gives you attribute access for free. But, if we make, for instance,  <code>model.ovr</code> actually <i>be</i> a recarray, then it doesn't allow adding extra metadata to the instance. So, there are two possibilities:

<ol>
<li>Use the composition pattern and have that <code>model.ovr.data</code> is the recarray, so we can have things like <code>model.ovr.savetype</code> as well.

</li>
<li>An alternative design would be to optimize for the most common use-case by making <code>model.ovr</code> be the recarray, and then putting the metadata somewhere else, such as <code>model.metadata.ovr.savetype</code>

</li>
</ol>

</li>
<li>For the moment, we are going to plump for the second option, even though it is a bit more work to implement. 
</li>
</ul>

</li>
</ul>








<pre class="src src-python"><span style="color: #008a00;">def</span> <span style="color: #00008a;">recarray_from_savefile</span>(filepath, skip=0):
    <span style="color: #008a00;">return</span> numpy.genfromtxt(filepath, delimiter=<span style="color: #698a21;">'\t'</span>, skip_header=skip,
                            invalid_raise=<span style="color: #008a00;">False</span>, names=<span style="color: #008a00;">True</span>).view(numpy.recarray)

</pre>







</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Parsing the input file </h3>
<div class="outline-text-3" id="text-1-5">



</div>

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> List of possibilities for cloudy save files </h4>
<div class="outline-text-4" id="text-1-5-1">


<ul>
<li>Taken from Hazy1 C10 version 2011/08/14
</li>
<li>This is nowhere near exhaustive
</li>
<li>These are checked in turn, so more specific types should come first. 
</li>
</ul>





<pre class="src src-python"><span style="color: #8a6407;">SAVETYPES</span> = [
    <span style="color: #698a21;">"diffuse continuum"</span>, 
    <span style="color: #698a21;">"emitted continuum"</span>, 
    <span style="color: #698a21;">"fine continuum"</span>, 
    <span style="color: #698a21;">"grain continuum"</span>, 
    <span style="color: #698a21;">"incident continuum"</span>, 
    <span style="color: #698a21;">"interactive continuum"</span>, 
    <span style="color: #698a21;">"ionizing continuum"</span>, 
    <span style="color: #698a21;">"outward continuum"</span>, 
    <span style="color: #698a21;">"raw continuum"</span>, 
    <span style="color: #698a21;">"reflected continuum"</span>, 
    <span style="color: #698a21;">"transmitted continuum"</span>, 
    <span style="color: #698a21;">"two photon continuum"</span>, 
    <span style="color: #698a21;">"continuum"</span>, 
    <span style="color: #698a21;">"cooling"</span>,
    <span style="color: #698a21;">"dr"</span>,
    <span style="color: #698a21;">"dynamics"</span>,
    <span style="color: #698a21;">"element hydrogen"</span>,
    <span style="color: #698a21;">"element helium"</span>,
    <span style="color: #698a21;">"element carbon"</span>,
    <span style="color: #698a21;">"element nitrogen"</span>,
    <span style="color: #698a21;">"element oxygen"</span>,
    <span style="color: #698a21;">"element sulfur"</span>,
    <span style="color: #698a21;">"element silicon"</span>,
    <span style="color: #698a21;">"element iron"</span>,
    <span style="color: #698a21;">"heating"</span>,
    <span style="color: #698a21;">"line emissivity"</span>,
    <span style="color: #698a21;">"line list"</span>, 
    <span style="color: #698a21;">"overview"</span>,
    <span style="color: #698a21;">"PDR"</span>,
    <span style="color: #698a21;">"physical conditions"</span>,
    <span style="color: #698a21;">"pressure"</span>,
    <span style="color: #698a21;">"radius"</span>,
    <span style="color: #698a21;">"source function, spectrum"</span>,
    <span style="color: #698a21;">"source function, depth"</span>,
    ]
</pre>





</div>

</div>

<div id="outline-container-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> <span class="todo TODO"> TODO</span> Find basic info about the run </h4>
<div class="outline-text-4" id="text-1-5-2">

<p>We should at least read the <code>title</code> and <code>save prefix</code> lines (currently we assume that the prefix is the same as for the input file). 
</p>



<pre class="src src-python"><span style="color: #008a00;">pass</span>

</pre>






</div>

</div>
