doc/parse-cloudy-output.html

<div id="outline-container-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> Find which save files were written </h4>
<div class="outline-text-4" id="text-1-5-3">


<p>
This originally seemed like a job for regular expressions, but that quickly got out of hand. 
</p>
<p>
Instead of allowing any type of save file, we use a finite list <code>SAVETYPES</code> since that makes the parsing much simpler. The only problem is that Cloudy allows the names to be abbreviated to four letters. 
</p>



<pre class="src src-python"><span style="color: #008a00;">def</span> <span style="color: #00008a;">find_save_commands</span>(s):
    <span style="color: #698a21;">"""</span>
<span style="color: #698a21;">    Find all save commands in a Cloudy input file and return a list of [type, file] pairs</span>

<span style="color: #698a21;">    &gt;&gt;&gt; find_save_commands('save heating last "</span>.heat<span style="color: #698a21;">"\\nsave cooling last "</span>.cool<span style="color: #698a21;">"')</span>
<span style="color: #698a21;">    [('heating', '.heat'), ('cooling', '.cool')]</span>
<span style="color: #698a21;">    """</span>
    save_commands = [] 
    <span style="color: #008a00;">for</span> line <span style="color: #008a00;">in</span> s.split(<span style="color: #698a21;">"\n"</span>):
        found = find_single_save_command(line)
        <span style="color: #008a00;">if</span> found: save_commands.append(found)
    <span style="color: #008a00;">return</span> save_commands <span style="color: #008a00;">or</span> <span style="color: #52858a;">None</span>


<span style="color: #008a00;">def</span> <span style="color: #00008a;">find_single_save_command</span>(line):
    <span style="color: #698a21;">"""</span>
<span style="color: #698a21;">    Parse single line of a Cloudy input file, looking for a save command</span>

<span style="color: #698a21;">    It should work both with C08-style (punch) and C10-style (save) commands:</span>

<span style="color: #698a21;">    &gt;&gt;&gt; find_single_save_command('save overview last "</span>.ovr<span style="color: #698a21;">"')</span>
<span style="color: #698a21;">    ('overview', '.ovr')</span>
<span style="color: #698a21;">    &gt;&gt;&gt; find_single_save_command('PUNCH LAST OVERVIEW "</span>.ovr<span style="color: #698a21;">"')</span>
<span style="color: #698a21;">    ('overview', '.ovr')</span>
<span style="color: #698a21;">    &gt;&gt;&gt; find_single_save_command('save over no buffering, last, file="</span>.ovr<span style="color: #698a21;">"')</span>
<span style="color: #698a21;">    ('overview', '.ovr')</span>
<span style="color: #698a21;">    &gt;&gt;&gt; find_single_save_command('save madeupname file="</span>.xyz<span style="color: #698a21;">"')</span>
<span style="color: #698a21;">    (None, '.xyz')</span>
<span style="color: #698a21;">    &gt;&gt;&gt; find_single_save_command('this is not the right command')</span>

<span style="color: #698a21;">    Note that the last command prints nothing since it returns None</span>

<span style="color: #698a21;">    """</span>
    line = line.lower()
    <span style="color: #008a00;">if</span> line.startswith(<span style="color: #698a21;">"save"</span>) <span style="color: #008a00;">or</span> line.startswith(<span style="color: #698a21;">"punch"</span>):
        <span style="color: #008a00;">assert</span> <span style="color: #698a21;">'"'</span> <span style="color: #008a00;">in</span> line <span style="color: #008a00;">or</span> <span style="color: #698a21;">"'"</span> <span style="color: #008a00;">in</span> line, <span style="color: #698a21;">"No filename given in save/punch command"</span>
        line = cut_out(line, <span style="color: #698a21;">"save"</span>)
        line = cut_out(line, <span style="color: #698a21;">"punch"</span>)
        <span style="color: #008a00;">if</span> <span style="color: #698a21;">"last"</span> <span style="color: #008a00;">in</span> line:
            line = cut_out(line, <span style="color: #698a21;">"last"</span>)
        <span style="color: #008a00;">if</span> <span style="color: #698a21;">'"'</span> <span style="color: #008a00;">in</span> line:
            delim = <span style="color: #698a21;">'"'</span>
        <span style="color: #008a00;">elif</span> <span style="color: #698a21;">"'"</span> <span style="color: #008a00;">in</span> line:
            delim = <span style="color: #698a21;">"'"</span>
        firstpart, savefile = line.split(delim)[:2]
        <span style="color: #008a00;">for</span> savetype <span style="color: #008a00;">in</span> SAVETYPES:
            <span style="color: #008a00;">if</span> look4stringinline(savetype, firstpart):
                <span style="color: #008a00;">return</span> savetype, savefile
        <span style="color: #473c8a;"># </span><span style="color: #473c8a;">failed to find anything</span>
        <span style="color: #008a00;">return</span> <span style="color: #52858a;">None</span>, savefile
    <span style="color: #008a00;">else</span>:
        <span style="color: #008a00;">return</span> <span style="color: #52858a;">None</span>


</pre>





</div>

</div>

<div id="outline-container-1-5-4" class="outline-4">
<h4 id="sec-1-5-4"><span class="section-number-4">1.5.4</span> Utility functions for input parsing </h4>
<div class="outline-text-4" id="text-1-5-4">




<pre class="src src-python"><span style="color: #008a00;">def</span> <span style="color: #00008a;">cut_out</span>(s, phrase):
    <span style="color: #698a21;">"""</span>
<span style="color: #698a21;">    Returns the input string &lt;s&gt; but with all occurrences of &lt;phrase&gt; deleted</span>

<span style="color: #698a21;">    &lt;phrase&gt; should be one or more words, separated by whitespace. Effort is made</span>
<span style="color: #698a21;">    to preserve one space between words, which makes it better than s.replace(phrase, '')</span>

<span style="color: #698a21;">    &gt;&gt;&gt; s = 'the quick brown fox, which is the brownest ever, jumped over the lazy dog'</span>
<span style="color: #698a21;">    &gt;&gt;&gt; cut_out(s, 'the')</span>
<span style="color: #698a21;">    'quick brown fox, which is brownest ever, jumped over lazy dog'</span>
<span style="color: #698a21;">    &gt;&gt;&gt; s.replace('the', '')</span>
<span style="color: #698a21;">    ' quick brown fox, which is  brownest ever, jumped over  lazy dog'</span>

<span style="color: #698a21;">    Note the extra spaces in the s.replace version</span>
<span style="color: #698a21;">    """</span>
    <span style="color: #008a00;">return</span> <span style="color: #698a21;">' '</span>.join(<span style="color: #8a4688;">map</span>(string.strip, s.split(phrase))).strip()

<span style="color: #008a00;">def</span> <span style="color: #00008a;">look4stringinline</span>(string, line):
    <span style="color: #698a21;">"""</span>
<span style="color: #698a21;">    Look for string in line, only comparing the first 4 characters of each word</span>

<span style="color: #698a21;">    This is because cloudy does the same.</span>

<span style="color: #698a21;">    Case should not matter: </span>
<span style="color: #698a21;">    &gt;&gt;&gt; look4stringinline('punch pressure', 'PUNC FINAL PRES')</span>
<span style="color: #698a21;">    True</span>

<span style="color: #698a21;">    And it is OK to have strings with less than 4 characters:</span>
<span style="color: #698a21;">    &gt;&gt;&gt; look4stringinline('PDR', 'save pdr')</span>
<span style="color: #698a21;">    True</span>

<span style="color: #698a21;">    And here is an example that should fail:</span>
<span style="color: #698a21;">    &gt;&gt;&gt; look4stringinline('save whatever', 'save foobar')</span>
<span style="color: #698a21;">    False</span>

<span style="color: #698a21;">    """</span>
    words = string.split()
    <span style="color: #008a00;">for</span> word <span style="color: #008a00;">in</span> words:
        <span style="color: #008a00;">if</span> <span style="color: #8a4688;">len</span>(word) &gt; 4: word = word[:4] 
        <span style="color: #008a00;">if</span> <span style="color: #008a00;">not</span> word.upper() <span style="color: #008a00;">in</span> line.upper():
            <span style="color: #008a00;">return</span> <span style="color: #008a00;">False</span>
    <span style="color: #008a00;">return</span> <span style="color: #008a00;">True</span>

</pre>





</div>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Mindlessly loading all the data from all the output files </h3>
<div class="outline-text-3" id="text-1-6">


</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> <span class="todo TODO"> TODO</span> Dealing with multiple iterations </h3>
<div class="outline-text-3" id="text-1-7">


<p>
For simplicity, we first implement only the last iteration. So, either 
</p>
<ol>
<li>There is only 1 iteration
</li>
<li>Only last iteration is saved (using "last" keyword)
</li>
<li>Or, we just ignore all the earlier ones
</li>
</ol>


<p>
Cases 1 and 2 are easiest to deal with, whereas Case 3 requires some preprocessing of the output file before using <code>numpy.genfromtxt</code>
</p>
<p>
There is also:
</p>
<ol>
<li>We use all the iterations
</li>
</ol>


<p>
Which requires a more complicated structure to hold them. 
</p>

</div>
</div>

</div>
