doc/parse-cloudy-output.org
* STARTED Tests for =claudia.py=
  :LOGBOOK:
   - Note taken on [2011-08-21 Sun 00:07] \\
     Changed mind - nose has clearer docs than py.test does
  CLOCK: [2011-08-20 Sat 23:40]--[2011-08-21 Sun 16:52] => 17:12
  :END:
   :PROPERTIES:
   :cache:    no
   :dir: ~/Work/Nahiely/proplyd-cloudy/src
   :END:
The main choices for testing frameworks are 

+ unittest http://docs.python.org/library/unittest.html
+ py.test http://doc.pytest.org/
+ nose http://www.somethingaboutorange.com/mrl/projects/nose/

After trying each of these, I have decided to use unittest because

+ It is in the standard library

+ [2011-08-23 Tue] With Python version 2.7, it seems that the =unittest= module can now do lots of the things that =nose= can do (e.g., automated discovery of tests). This is backported to earlier pythons as =unittest2=

+ The online documentation seems clearer

I am also using =doctest= lines in the documentation strings, mainly to ensure that documentation of API is accurate. 

Scripts for running all the tests are given below for [[id:6F33DE3F-2B88-4934-9A63-FA02441BB188][unittest]] and [[id:929CD6C9-98BE-4698-A27C-78E7060AB4D1][doctest]]. 

** Example data for tests
Put some test data in a top-level directory =testdata= 

** Unittest tests
   :LOGBOOK:
   CLOCK: [2011-08-23 Tue 10:50]--[2011-08-23 Tue 13:45] =>  2:55
   :END:



*** Example unittest tests
    :LOGBOOK:
     - Note taken on [2011-08-23 Tue 11:10] \\
       Note that we had to use test_claudia.py not test-claudia.py since the latter is not a valid module name.
     - Note taken on [2011-08-23 Tue 11:02] \\
       First version is a straight port of the nose tests I already had
    :END:
     :PROPERTIES:
     :tangle:   ../src/test_claudia.py
     :END:

#+srcname: unittest-claudia
#+begin_src python
  import unittest
  from claudia import CloudyModel
  
  class ClaudiaTestSample01(unittest.TestCase):
      def setUp(self):
          "set up test fixtures"
          self.model = CloudyModel('sample01', 
                                   indir='../testdata', 
                                   outdir='../testdata',
                                   skipsaves=[])
  
      # def teardown_func():
      #     "tear down test fixtures"
  
      def test_doomed_to_fail(self):
          self.assertEquals(1, 2)
  
      def test_infilepath(self):
          self.assertEquals(self.model.infilepath, '../testdata/sample01.in')
  
#+end_src

*** Run all the unit tests
    :PROPERTIES:
    :exports:  both
    :ID:       6F33DE3F-2B88-4934-9A63-FA02441BB188
    :END:
#+srcname: run-claudia-unitttests
#+begin_src sh :tangle no :results output
  echo "Running unit tests in $(pwd)"
  python -m unittest discover -v 2>&1 
  echo
  echo "Tests last ran $(date)"
#+end_src

#+results: run-claudia-unitttests
#+begin_example
Running unit tests in /Users/will/Work/Nahiely/proplyd-cloudy/src
test_doomed_to_fail (test_claudia.ClaudiaTestSample01) ... FAIL
test_infilepath (test_claudia.ClaudiaTestSample01) ... ok

======================================================================
FAIL: test_doomed_to_fail (test_claudia.ClaudiaTestSample01)
----------------------------------------------------------------------
Traceback (most recent call last):
  File "/Users/will/Work/Nahiely/proplyd-cloudy/src/test_claudia.py", line 17, in test_doomed_to_fail
    self.assertEquals(1, 2)
AssertionError: 1 != 2

----------------------------------------------------------------------
Ran 2 tests in 0.205s

FAILED (failures=1)

Tests last ran Wed Aug 24 09:49:37 CDT 2011
#+end_example




** Doctest tests
   :LOGBOOK:
   CLOCK: [2011-06-28 Tue 13:27]--[2011-06-28 Tue 13:28] =>  0:01
   :END:

Doctest gets mixed reviews. It is the simplest of all to use and seems to be fine for illustrating how to call functions and to make sure that the documentation is in sync with the code. Lots of people warn that it should not replace proper unit testing though. 

*** DONE Run all the doctest tests in claudia.py
    CLOSED: [2011-06-28 Tue 14:24]
    :LOGBOOK:
     - Note taken on [2011-08-20 Sat 14:13] \\
       Print the time that test was last run
     - Note taken on [2011-06-28 Tue 14:24] \\
       Re-factored to be standalone test
    :END:
     :PROPERTIES:
     :exports:  both
     :ID:       929CD6C9-98BE-4698-A27C-78E7060AB4D1
     :END:


#+srcname: claudia-doctests
#+begin_src python :tangle no :results output
  import doctest
  import claudia
  from datetime import datetime
  doctest.testmod(claudia)
  print 'Tests last ran ', datetime.now()
#+end_src

#+results: claudia-doctests
: Tests last ran  2011-08-24 09:49:19.405874



* Infrastructure for tangling the code and exporting HTML docs

+ Tangle the source code with =C-c C-v t=
+ Export to HTML with =C-c C-e h= (or =C-c C-e b= to also browse)
+ Run the tests with =C-c C-c= in the relevent source code block
  + Tests are also run automatically when exporting to HTML

** TODO How can we automate this better?

There was a post on the org mailing list a while back with something similar. 

** Export template						   :noexport:
#+TITLE:     Parse Cloudy Output with claudia.py
#+AUTHOR:    William Henney
#+EMAIL:     whenney@gmail.com
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:5 num:t toc:t \n:nil @:t ::t |:t ^:{} -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

* Scratch pad 							   :noexport:
** Can class definitions come after use?
   :PROPERTIES:
   :tangle:   no
   :END:

No it can't - which is obvious really. 

#+srcname: def-before-use
#+begin_src python :results output
  
   
  class A(object):
      def __init__(self):
          print "Initialized"
  
  a = A()
  
#+end_src

#+results: def-before-use
: Initialized

#+srcname: use-before-def
#+begin_src python :results output
  a = A()
   
  class A(object):
      def __init__(self):
          print "Initialized"
  
  
#+end_src

#+stderr: use-before-def
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
: NameError: name 'A' is not defined



