doc/parse-cloudy-output.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <span class="todo STARTED"> STARTED</span> Tests for <code>claudia.py</code> </h2>
<div class="outline-text-2" id="text-2">

<p>The main choices for testing frameworks are 
</p>
<ul>
<li>unittest <a href="http://docs.python.org/library/unittest.html">http://docs.python.org/library/unittest.html</a>
</li>
<li>py.test <a href="http://doc.pytest.org/">http://doc.pytest.org/</a>
</li>
<li>nose <a href="http://www.somethingaboutorange.com/mrl/projects/nose/">http://www.somethingaboutorange.com/mrl/projects/nose/</a>
</li>
</ul>


<p>
After trying each of these, I have decided to use unittest because
</p>
<ul>
<li>It is in the standard library

</li>
<li><span class="timestamp-wrapper"> <span class="timestamp">2011-08-23 Tue</span></span> With Python version 2.7, it seems that the <code>unittest</code> module can now do lots of the things that <code>nose</code> can do (e.g., automated discovery of tests). This is backported to earlier pythons as <code>unittest2</code>

</li>
<li>The online documentation seems clearer
</li>
</ul>


<p>
I am also using <code>doctest</code> lines in the documentation strings, mainly to ensure that documentation of API is accurate. 
</p>
<p>
Scripts for running all the tests are given below for <a href="#sec-2-2-2">unittest</a> and <a href="#sec-2-3-1">doctest</a>. 
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Example data for tests </h3>
<div class="outline-text-3" id="text-2-1">

<p>Put some test data in a top-level directory <code>testdata</code> 
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Unittest tests </h3>
<div class="outline-text-3" id="text-2-2">





</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Example unittest tests </h4>
<div class="outline-text-4" id="text-2-2-1">





<pre class="src src-python"><span style="color: #008a00;">import</span> unittest
<span style="color: #008a00;">from</span> claudia <span style="color: #008a00;">import</span> CloudyModel

<span style="color: #008a00;">class</span> <span style="color: #218a21;">ClaudiaTestSample01</span>(unittest.TestCase):
    <span style="color: #008a00;">def</span> <span style="color: #00008a;">setUp</span>(<span style="color: #008a00;">self</span>):
        <span style="color: #698a21;">"set up test fixtures"</span>
        <span style="color: #008a00;">self</span>.model = CloudyModel(<span style="color: #698a21;">'sample01'</span>, 
                                 indir=<span style="color: #698a21;">'../testdata'</span>, 
                                 outdir=<span style="color: #698a21;">'../testdata'</span>,
                                 skipsaves=[])

    <span style="color: #473c8a;"># </span><span style="color: #473c8a;">def teardown_func():</span>
    <span style="color: #473c8a;">#     </span><span style="color: #473c8a;">"tear down test fixtures"</span>

    <span style="color: #008a00;">def</span> <span style="color: #00008a;">test_doomed_to_fail</span>(<span style="color: #008a00;">self</span>):
        <span style="color: #008a00;">self</span>.assertEquals(1, 2)

    <span style="color: #008a00;">def</span> <span style="color: #00008a;">test_infilepath</span>(<span style="color: #008a00;">self</span>):
        <span style="color: #008a00;">self</span>.assertEquals(<span style="color: #008a00;">self</span>.model.infilepath, <span style="color: #698a21;">'../testdata/sample01.in'</span>)

</pre>





</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><a name="ID-6F33DE3F-2B88-4934-9A63-FA02441BB188" id="ID-6F33DE3F-2B88-4934-9A63-FA02441BB188"></a><span class="section-number-4">2.2.2</span> Run all the unit tests </h4>
<div class="outline-text-4" id="text-2-2-2">




<pre class="src src-sh"><span style="color: #8a4688;">echo</span> <span style="color: #698a21;">"Running unit tests in $(</span><span style="color: #ff00ff;">pwd</span><span style="color: #698a21;">)"</span>
python -m unittest discover -v 2&gt;&amp;1 
<span style="color: #8a4688;">echo</span>
<span style="color: #8a4688;">echo</span> <span style="color: #698a21;">"Tests last ran $(</span><span style="color: #ff00ff;">date</span><span style="color: #698a21;">)"</span>
</pre>







<pre class="example">Running unit tests in /Users/will/Work/Nahiely/proplyd-cloudy/src
test_doomed_to_fail (test_claudia.ClaudiaTestSample01) ... FAIL
test_infilepath (test_claudia.ClaudiaTestSample01) ... ok

======================================================================
FAIL: test_doomed_to_fail (test_claudia.ClaudiaTestSample01)
----------------------------------------------------------------------
Traceback (most recent call last):
  File "/Users/will/Work/Nahiely/proplyd-cloudy/src/test_claudia.py", line 17, in test_doomed_to_fail
    self.assertEquals(1, 2)
AssertionError: 1 != 2

----------------------------------------------------------------------
Ran 2 tests in 0.384s

FAILED (failures=1)

Tests last ran Wed Aug 24 13:12:17 CDT 2011
</pre>






</div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Doctest tests </h3>
<div class="outline-text-3" id="text-2-3">


<p>
Doctest gets mixed reviews. It is the simplest of all to use and seems to be fine for illustrating how to call functions and to make sure that the documentation is in sync with the code. Lots of people warn that it should not replace proper unit testing though. 
</p>

</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><a name="ID-929CD6C9-98BE-4698-A27C-78E7060AB4D1" id="ID-929CD6C9-98BE-4698-A27C-78E7060AB4D1"></a><span class="section-number-4">2.3.1</span> <span class="done DONE"> DONE</span> Run all the doctest tests in claudia.py </h4>
<div class="outline-text-4" id="text-2-3-1">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2011-06-28 Tue 14:24</span></span><br/>
</p>




<pre class="src src-python"><span style="color: #008a00;">import</span> doctest
<span style="color: #008a00;">import</span> claudia
<span style="color: #008a00;">from</span> datetime <span style="color: #008a00;">import</span> datetime
doctest.testmod(claudia)
<span style="color: #008a00;">print</span> <span style="color: #698a21;">'Tests last ran '</span>, datetime.now()
</pre>




<pre class="example">
None
</pre>



<pre class="example">
Tests last ran  2011-08-24 13:12:18.902963
</pre>




</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Infrastructure for tangling the code and exporting HTML docs </h2>
<div class="outline-text-2" id="text-3">


<ul>
<li>Tangle the source code with <code>C-c C-v t</code>
</li>
<li>Export to HTML with <code>C-c C-e h</code> (or <code>C-c C-e b</code> to also browse)
</li>
<li>Run the tests with <code>C-c C-c</code> in the relevent source code block
<ul>
<li>Tests are also run automatically when exporting to HTML
</li>
</ul>

</li>
</ul>



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> <span class="todo TODO"> TODO</span> How can we automate this better? </h3>
<div class="outline-text-3" id="text-3-1">


<p>
There was a post on the org mailing list a while back with something similar. 
</p>
</div>
</div>
</div>
</div>

</body>
</html>
